smokeypell/platform-hc32f460kcta/misc/svd/HDSC_HC32F460KCTA.svd
<?xml version="1.0" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>HDSC</vendor>
    <vendorID>HDSC</vendorID>
    <name>HDSC_HC32F460KCTA</name>
    <series>ARMCM4</series>
    <version>1.0</version>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x0</resetValue>
    <resetMask>0x0</resetMask>
    <peripherals>
        <peripheral>
            <name>ADC1</name>
            <description>desc ADC</description>
            <baseAddress>0x40040000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xD0</size>
            </addressBlock>
            <registers>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRT</name>
                            <description>desc STRT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F3</resetMask>
                    <fields>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACCSEL</name>
                            <description>desc ACCSEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>desc CLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFMT</name>
                            <description>desc DFMT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVCNT</name>
                            <description>desc AVCNT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>RSCHSEL</name>
                            <description>desc RSCHSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRGSR</name>
                    <description>desc TRGSR</description>
                    <addressOffset>0xA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8787</resetMask>
                    <fields>
                        <field>
                            <name>TRGSELA</name>
                            <description>desc TRGSELA</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENA</name>
                            <description>desc TRGENA</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGSELB</name>
                            <description>desc TRGSELB</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENB</name>
                            <description>desc TRGENB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRA0</name>
                    <description>desc CHSELRA0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CHSELRA1</name>
                    <description>desc CHSELRA1</description>
                    <addressOffset>0xE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>CHSELA16</name>
                            <description>desc CHSELA16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRB0</name>
                    <description>desc CHSELRB0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CHSELRB1</name>
                    <description>desc CHSELRB1</description>
                    <addressOffset>0x12</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>CHSELB16</name>
                            <description>desc CHSELB16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AVCHSELR0</name>
                    <description>desc AVCHSELR0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AVCHSELR1</name>
                    <description>desc AVCHSELR1</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>AVCHSEL16</name>
                            <description>desc AVCHSEL16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTR0</name>
                    <description>desc SSTR0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR1</name>
                    <description>desc SSTR1</description>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR2</name>
                    <description>desc SSTR2</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR3</name>
                    <description>desc SSTR3</description>
                    <addressOffset>0x23</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR4</name>
                    <description>desc SSTR4</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR5</name>
                    <description>desc SSTR5</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR6</name>
                    <description>desc SSTR6</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR7</name>
                    <description>desc SSTR7</description>
                    <addressOffset>0x27</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR8</name>
                    <description>desc SSTR8</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR9</name>
                    <description>desc SSTR9</description>
                    <addressOffset>0x29</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR10</name>
                    <description>desc SSTR10</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR11</name>
                    <description>desc SSTR11</description>
                    <addressOffset>0x2B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR12</name>
                    <description>desc SSTR12</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR13</name>
                    <description>desc SSTR13</description>
                    <addressOffset>0x2D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR14</name>
                    <description>desc SSTR14</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR15</name>
                    <description>desc SSTR15</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTRL</name>
                    <description>desc SSTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CHMUXR0</name>
                    <description>desc CHMUXR0</description>
                    <addressOffset>0x38</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x3210</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CH00MUX</name>
                            <description>desc CH00MUX</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH01MUX</name>
                            <description>desc CH01MUX</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH02MUX</name>
                            <description>desc CH02MUX</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH03MUX</name>
                            <description>desc CH03MUX</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMUXR1</name>
                    <description>desc CHMUXR1</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x7654</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CH04MUX</name>
                            <description>desc CH04MUX</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH05MUX</name>
                            <description>desc CH05MUX</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH06MUX</name>
                            <description>desc CH06MUX</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH07MUX</name>
                            <description>desc CH07MUX</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMUXR2</name>
                    <description>desc CHMUXR2</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xBA98</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CH08MUX</name>
                            <description>desc CH08MUX</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH09MUX</name>
                            <description>desc CH09MUX</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH10MUX</name>
                            <description>desc CH10MUX</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH11MUX</name>
                            <description>desc CH11MUX</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMUXR3</name>
                    <description>desc CHMUXR3</description>
                    <addressOffset>0x3E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFEDC</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CH12MUX</name>
                            <description>desc CH12MUX</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH13MUX</name>
                            <description>desc CH13MUX</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH14MUX</name>
                            <description>desc CH14MUX</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH15MUX</name>
                            <description>desc CH15MUX</description>
                            <msb>15</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
