smokeypell/platform-hc32f460kcta/misc/svd/HDSC_HC32F460KCTA.svd
                <register>
                    <name>RGCR14</name>
                    <description>desc RGCR14</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x838383</resetMask>
                    <fields>
                        <field>
                            <name>S2RGRP</name>
                            <description>desc S2RGRP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S2RGWP</name>
                            <description>desc S2RGWP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S2RGE</name>
                            <description>desc S2RGE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGRP</name>
                            <description>desc S1RGRP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGWP</name>
                            <description>desc S1RGWP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGE</name>
                            <description>desc S1RGE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGRP</name>
                            <description>desc FRGRP</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGWP</name>
                            <description>desc FRGWP</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGE</name>
                            <description>desc FRGE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RGCR15</name>
                    <description>desc RGCR15</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x838383</resetMask>
                    <fields>
                        <field>
                            <name>S2RGRP</name>
                            <description>desc S2RGRP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S2RGWP</name>
                            <description>desc S2RGWP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S2RGE</name>
                            <description>desc S2RGE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGRP</name>
                            <description>desc S1RGRP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGWP</name>
                            <description>desc S1RGWP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>S1RGE</name>
                            <description>desc S1RGE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGRP</name>
                            <description>desc FRGRP</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGWP</name>
                            <description>desc FRGWP</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FRGE</name>
                            <description>desc FRGE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F8F8F</resetMask>
                    <fields>
                        <field>
                            <name>SMPU2BRP</name>
                            <description>desc SMPU2BRP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU2BWP</name>
                            <description>desc SMPU2BWP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU2ACT</name>
                            <description>desc SMPU2ACT</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU2E</name>
                            <description>desc SMPU2E</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU1BRP</name>
                            <description>desc SMPU1BRP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU1BWP</name>
                            <description>desc SMPU1BWP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU1ACT</name>
                            <description>desc SMPU1ACT</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPU1E</name>
                            <description>desc SMPU1E</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMPUBRP</name>
                            <description>desc FMPUBRP</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMPUBWP</name>
                            <description>desc FMPUBWP</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMPUACT</name>
                            <description>desc FMPUACT</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMPUE</name>
                            <description>desc FMPUE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10101</resetMask>
                    <fields>
                        <field>
                            <name>SMPU2EAF</name>
                            <description>desc SMPU2EAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMPU1EAF</name>
                            <description>desc SMPU1EAF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FMPUEAF</name>
                            <description>desc FMPUEAF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECLR</name>
                    <description>desc ECLR</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10101</resetMask>
                    <fields>
                        <field>
                            <name>SMPU2ECLR</name>
                            <description>desc SMPU2ECLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SMPU1ECLR</name>
                            <description>desc SMPU1ECLR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FMPUECLR</name>
                            <description>desc FMPUECLR</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WP</name>
                    <description>desc WP</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPUWE</name>
                            <description>desc MPUWE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKEY</name>
                            <description>desc WKEY</description>
                            <msb>15</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
