smokeypell/platform-hc32f460kcta/misc/svd/HDSC_HC32F460KCTA.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART2</name>
            <description>desc USART</description>
            <baseAddress>0x4001D400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART3</name>
            <description>desc USART</description>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART4</name>
            <description>desc USART</description>
            <baseAddress>0x40021400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>USBFS</name>
            <description>desc USBFS</description>
            <baseAddress>0x400C0000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xE04</size>
            </addressBlock>
            <registers>
                <register>
                    <name>GVBUSCFG</name>
                    <description>desc GVBUSCFG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>VBUSOVEN</name>
                            <description>desc VBUSOVEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUSVAL</name>
                            <description>desc VBUSVAL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAHBCFG</name>
                    <description>desc GAHBCFG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1BF</resetMask>
                    <fields>
                        <field>
                            <name>GINTMSK</name>
                            <description>desc GINTMSK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HBSTLEN</name>
                            <description>desc HBSTLEN</description>
                            <msb>4</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>desc DMAEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFELVL</name>
                            <description>desc TXFELVL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFELVL</name>
                            <description>desc PTXFELVL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUSBCFG</name>
                    <description>desc GUSBCFG</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA00</resetValue>
                    <resetMask>0x60003C47</resetMask>
                    <fields>
                        <field>
                            <name>TOCAL</name>
                            <description>desc TOCAL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYSEL</name>
                            <description>desc PHYSEL</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRDT</name>
                            <description>desc TRDT</description>
                            <msb>13</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FHMOD</name>
                            <description>desc FHMOD</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FDMOD</name>
                            <description>desc FDMOD</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRSTCTL</name>
                    <description>desc GRSTCTL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0xC00007F7</resetMask>
                    <fields>
                        <field>
                            <name>CSRST</name>
                            <description>desc CSRST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSRST</name>
                            <description>desc HSRST</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCRST</name>
                            <description>desc FCRST</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFFLSH</name>
                            <description>desc RXFFLSH</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFFLSH</name>
                            <description>desc TXFFLSH</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>10</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAREQ</name>
                            <description>desc DMAREQ</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AHBIDL</name>
                            <description>desc AHBIDL</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINTSTS</name>
                    <description>desc GINTSTS</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x14000020</resetValue>
                    <resetMask>0xF77CFCFB</resetMask>
                    <fields>
                        <field>
                            <name>CMOD</name>
                            <description>desc CMOD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMIS</name>
                            <description>desc MMIS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>desc SOF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFNE</name>
                            <description>desc RXFNE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXFE</name>
                            <description>desc NPTXFE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GINAKEFF</name>
                            <description>desc GINAKEFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONAKEFF</name>
                            <description>desc GONAKEFF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ESUSP</name>
                            <description>desc ESUSP</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUSP</name>
                            <description>desc USBSUSP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRST</name>
                            <description>desc USBRST</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMDNE</name>
                            <description>desc ENUMDNE</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOODRP</name>
                            <description>desc ISOODRP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPF</name>
                            <description>desc EOPF</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEPINT</name>
                            <description>desc IEPINT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OEPINT</name>
                            <description>desc OEPINT</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IISOIXFR</name>
                            <description>desc IISOIXFR</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IPXFR_INCOMPISOOUT</name>
                            <description>desc IPXFR_INCOMPISOOUT</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAFSUSP</name>
                            <description>desc DATAFSUSP</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPRTINT</name>
                            <description>desc HPRTINT</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HCINT</name>
                            <description>desc HCINT</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXFE</name>
                            <description>desc PTXFE</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CIDSCHG</name>
                            <description>desc CIDSCHG</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DISCINT</name>
                            <description>desc DISCINT</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUSVINT</name>
                            <description>desc VBUSVINT</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKUINT</name>
                            <description>desc WKUINT</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
